{
  "text": "At the dawn of Ghana's independence on the 6th of March, 1957, it was much better placed to attain rapid socio-economic development, compared to the likes of Malaysia, South Korea, and India. Ghana had a booming population that could spur rapid economic growth, with education and proper skills training being the needed catalysts to make this a reality. It had natural resources that many other nations could only dream of.\n\nGhana, our Ghana, has always been a nation blessed to the point of repletion with human and natural resources. Yet today's Ghana, with the same resources as back then, and, in fact, a lot more, cannot be celebrated or exalted as we were some almost 67 years ago. Today's Ghana under the fourth Republic cannot hold a candle to the one we left behind, in a bid to make greater strides.\n\nBut where, exactly, did we lose the plot? \n\nWhile the lack of proper leadership, coupled with the decay in governance systems and the loss of patriotism in our politics did not start today, I shall say this, and forcefully so: the NDC and the NPP, our country’s foremost political parties in this Fourth Republic, have shown themselves to be no more than two sides of the same coin who alternate in power. In fact, I daresay that the NDC and the NPP are conjoined twins; they go into opposition from time to time, but never really leave power. \n\nHow many times have we not heard of how, even in opposition, these two political parties have hobnobbed in scheming to make poorer and poorer the ordinary Ghanaian while their party loyalists have become richer and richer? Yes, they may go into opposition, but they still remain beneficiaries of a warped system that continues to feed their greed and entitled posture – while the masses struggle to even eke out a living! A very good example of this is the repulsive ex-gratia payments they make to themselves after every 4-year political cycle, using taxpayers’ money – without any input whatsoever from the taxpayer.\n\nThe fact that every one of these administrations, be it of NDC or NPP stock, has gone, cup in hand, to the IMF since 1995 is a case in point! I ask: if they knew the way to real economic growth and prosperity, would they not have shown same, and would we not have witnessed those capabilities after all these terms in office? "
}