{
  "text": "Ladies and gentlemen, after 32 years of experimenting with these two political parties which have done nothing but aimlessly tinker with our economy and all other aspects of our national life, we are left with a staggering debt baggage of some 600 Billion Ghana Cedis.\n\nAll this debt, my brothers and sisters, was contracted when one party (either the NDC or the NPP) controlled both the Presidency and Parliament. The practice, therefore, where, as voters we give one political party both the executive and legislature has not helped the country. \n\nFor 32 years these two political parties have played Ping-Pong with us: alternating in power, only to loot and share among themselves – to the utter detriment and impoverishment of the majority of Ghanaian! Our road network, which I came face to face with as I toured 264 out of Ghana’s 268 Districts is in shambles. (I couldn’t enter the remaining 4 Districts owing to the sad and turbulent situation in Bawku). These are death traps waiting to devour human lives, and we look on! We still have schools under trees in Ghana today, as I speak – thousands of them! \n\nAs of October 2023, Ghana had 2,417 schools under trees! \n\nWe were coaxed into believing that galamsey would be taken out, root and branch, with President Akufo-Addo putting his presidency on the line – as a pledge. Galamsey, today, is a hydra-headed demon that our own politicians and party executives are using to enrich themselves! \n\nWe were promised an incorruptible leadership devoid of family and friends arrangements. Today we all know and see that, that is not the case.\n\nThese abuses of power are what I stand here, before you, to lead the charge to correct!\n\nThis is some of the deceitfulness in our public leadership that we need to check now, or else, forever hold our peace! This is why we mean to “Break the 2” and, by so doing, break the stranglehold these two parties have had on our political life! We cannot bequeath a broke, failing Ghana to posterity, so, I call on you to help me “Break the 2” and rescue Ghana!"
}