{
  "text": "It talks about the State taking “appropriate measures to promote the development of agriculture and industry.  To this end my government will introduce an initiative I have titled:\n\nDOMESTIC DIRECT INVESTMENTS (DDI)\n\nWhilst Foreign Direct Investments (FDI) is fashioned to attract and promote foreign investments in the country; DDI does the opposite: attracting anyone who lives in Ghana to invest their money in Ghana in by creating jobs and producing products that uses raw materials sourced in Ghana.  Businesses that qualify as DDI companies will enjoy lower taxes. \n\nChapter 6 talks about governments “as far as practicable continuing and executing projects and programs commenced by previous government. Not abandoning them as successive governments under the fourth republic have done. Causing the State to lose millions if not billions of Ghana Cedis.It talks about the “state promoting a culture of political tolerance amongst Ghanaians. Instead, what we have today, is a political culture that promotes only hate, division and intolerance. \n\nIt states that the State “shall take steps to eradicate corrupt practices and the abuse of state power”. Instead under the NDC and the NPP what we have witnessed is a system of, “create, loot and share”. Contracts being awarded without recourse to the Procurement Act. Monies, including foreign exchange being found in the homes of government ministers, and many such blatant corrupt practices.\n\nChapter 6 also talks about so many other things including: “the state taking measures needed to protect and safeguard the national environment for posterity”; instead, today what we see and read is the wanton and blatant destruction of our national environment including water bodies by all manner of persons including politicians and to make matters worse, the passage of legislation to further abuse our environment. Here I am talking about LI 2462. To this effect my government, in consultation with relevant and interested parties in the sector, shall repeal LI 2462, in respect of regulation concerning the ability to mine in Forest Reserves and enforce environmental protection for the benefit of us all – and for our future generations!\n\nAs Head of State, my government will fight the menace of galamsey without fear nor favour, with enforcement of existing laws, passing new laws where necessary, tightening loopholes in existing laws, and providing alternative livelihoods such as: Carbon Credit harvesting and a legal  Industrial Hemp industry to the youth in galamsey and other Ghanaians who  want to venture into those areas."
}